import Vue from 'vue'

export const rules = {
  must: [(v) => !!v || '必須入力項目です'],
  min8: [(v) => String(v).length >= 8 || '8文字以上で入力してください'],
  zip: [
    (v) => !!v || "必須入力項目です",
    (v) =>
      /^[0-9]{3}-[0-9]{4}$/.test(v) ||
      /^[0-9]{7}$/.test(v) ||
      "郵便番号の形式が不正です",
  ],
  max8: [
    (v) => String(v).length <= 8 || '8文字以内で入力してください',
  ],
  max16: [
    (v) => String(v).length <= 16 || '16文字以内で入力してください',
  ],
  max32: [
    (v) => String(v).length <= 32 || '32文字以内で入力してください',
  ],
  max64: [
    (v) => String(v).length <= 64 || '64文字以内で入力してください',
  ],
  max128: [
    (v) => String(v).length <= 128 || '128文字以内で入力してください',
  ],
  tel: [
    (v) => !!v || "必須入力項目です",
    (v) =>
      /^0[0-9]{1,4}-[0-9]{1,6}(-[0-9]{0,5})?$/.test(v) ||
      /^[0-9]{7,13}$/.test(v) ||
      "電話番号の形式が不正です",
  ],
  tel_col3: [
    (v) => !!v || "必須入力項目です",
    (v) => String(v).length <= 8 || '8文字以内で入力してください',
    (v) => Number.isInteger(+v) || '整数値で入力ください',
  ],
  email: [
    (v) => !!v || "必須入力項目です",
    (v) => /.+@.+\..+/.test(v) || "メールアドレスの形式が不正です",
  ],
  int: [
    (v) => Number.isInteger(+v) || '整数値で入力してください',
    (v) => +v > 0 || '0以上の数値を入力してください',
  ],
}

Vue.prototype.$rules = rules 
